Tekla.Structures.Model.UI.ModelViewEnumerator
The ModelViewEnumerator class is an enumerator class for model views.
The enumerator enables model view items to be looped.

Tekla.Structures.Model.UI.ModelViewEnumerator.Current
Returns the current view.

Tekla.Structures.Model.UI.ModelViewEnumerator.Count
Returns the number of views in the enumerator.

Tekla.Structures.Model.UI.ModelViewEnumerator.CurrentViewId
Gets the current view identifier.

Tekla.Structures.Model.UI.ModelViewEnumerator.MoveNext
Moves to the next view in the enumerator.
Returns: False on failure.

Tekla.Structures.Model.UI.ModelViewEnumerator.Reset
Resets the enumerator.